[
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-are-some-recurring-fun-activities-or-games-that-can-help-instill-tolerance-and-empathy-in-children",
        "title": "What are some recurring fun activities or games that can help instill tolerance and empathy in children?",
        "num upvote": 10,
        "answer": "There are so many fun things you can do with children to expose them to a wide range of people and cultures and teach them the value of empathy. Really you can apply these messages to almost anything you do. Talk to your kids about situations they’ve seen or experienced and how they can become advocates for themselves and others. Tell them about experiences you’ve had to open up conversations. Normalize different cultures you see on TV, out in the world, next door, etc. Set aside judgement and talk about how people come from all walks of life and what life must be like for people who have different experiences. Open and honest communication is the best jumping off point for teaching kids about tolerance and empathy and really you can apply it every day!Setting an example: Children mimic what you do. The best thing you can do for your child is to set an example no matter what you are doing. Take an interest in helping others through community outreach, bring your kids along when appropriate. Get involved in programs that promote diversity. Even if your kids are not involved, you can talk to them about it and they can see that it’s important to you.Playing games: Kids get competitive, it’s only natural. Teaching them to be great sports (not sore losers) and to challenge themselves is a great way to teach them that life won’t always go their way and to be happy for others that succeed. Don’t let them win when you play games at home, but be happy for them when they do! Get them involved in sports and activities outside of your neighborhood so they can meet people from different places and form bonds with kids outside of where they live. Exposing children to different walks of life is crucial. How can they be empathetic towards people they don’t know? Teaching them to navigate the emotions of winning and losing is key when it comes to empathy and tolerance and what better way to do that than with a group of new people?Cultural events: Check out what cultural events are happening in your area. Talk about why they are significant and what kinds of people are represented (or not represented) there. Do some research ahead of time to learn about the community you’re going to visit. Make observations about how people there are different and the same as you and how that is awesome! Are there things you can learn from other cultures that you can start doing in your own home? Be careful of cultural appropriation, though, use that as an opportunity to talk to your kids about the difference between celebrating a different culture and using it as a source of amusement for yourself.Role models: There is this theory that children should be surrounded by a “stew” - a group of people from all walks of life - to help teach them about different kinds of people, families, relationships… I have a hard time with this because I am weary of making friends for my kids based solely on someone’s identity. Hopefully, if you do some of the things above, bonds will naturally form across cultural lines and your children will see that it’s a positive to make connections with people outside of your regular circle. Show them examples of leaders that come from different backgrounds, read books to them about strong people from different countries. Point out when people defy stereotypes.Honesty & discussion: The most important thing you can do with your kids is to be open and honest with them. Do you have some prejudices you aren’t proud of? Talk to your kids about them. Point out when people are victims of prejudice or discrimination. Talk to your kids about how people from different backgrounds have different experiences than they do because of the color of their skin, or their gender, etc. and how that’s not necessarily fair. Talk to them about the advantages they have because of who they are and how some other people might have more to overcome. Talk to them about how they can be advocates for those people. Talk to them about how they can be aware and help make change.Books and movies: When all else fails, the best representations of our culture and the diversity (or lack there of) is in pop culture. What shows are hot right now? What movies have come out recently that tackle diversity issues? I just had a great conversation with my eight year old about the movie Moonlight and how it was important because it showed a story that hasn’t been told before about someone who comes from a background that is typically portrayed as a stereotype in TV and movies. Talk about what the shows they are watching and the books they are reading do well when it comes to addressing different people and what they do poorly. I’m looking forward to taking my kids to see Beauty and the Beast this weekend and discussing the evolving role of the princess in distress.Everything is a jumping off point for conversation. Don’t shy away from topics that are difficult to navigate. Be open and honest. Telling your children to be “colorblind” is a dangerous message - for one, it’s not clear why and it also dismisses the fact that people from different backgrounds have different experiences that we should be sensitive to and appreciate. Teach them that diversity is something to be aware of and to celebrate and to be involved in, through community outreach, through sports, through cultural events, and what they are exposed to through the media. That’s the most important message of all."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-are-the-best-books-to-read-with-young-children-that-stress-empathy-diversity-and-tolerance",
        "title": "What are the best books to read with young children that stress empathy, diversity, and tolerance?",
        "num upvote": 8,
        "answer": "There are so many great book options for kids of all ages when it comes to teaching diversity. Sometimes books are the best way to expose children to different ideas and cultures they may not experience in the real world. If you want to start them young, here are some suggestions.For really young kids, I would start out easy. Todd Parr has some amazing kid books (also in the board book variety) about inclusion and diversity (and the earth!) that use simple shapes and colors to explain how people come from different places and have different families and how sometimes people feel sad. This is a great starting point for ages 2–4.Preschool age kids can dive into (and wrap their heads around) stories. Some of my favorites that include empathy and tolerance are Princess Boy - about a boy who likes pink and likes to wear dresses and is loved for who he is. This helps kids normalize that other children might be into different things and it’s ok to defy gender stereotypes. Another one I love is Tango Makes Three - based on a true story, two male penguins try to hatch a rock and desperately want a baby penguin to take care of and call their own. The zookeeper sees their determination and gives them an egg that needs caring for and they raise the baby penguin as any loving parents would. I love this book because it’s about animals - which preschool age kids love - and it shows two male parents. Oftentimes kids books about same gender couples are about women, it’s important to show that dads can be equally caring and loving parents. Other honorable mentions: The Paper Bag Princess, William’s Doll, The Sissy Duckling, King and King.Some other stories I like are, The Miss Spider series - in which Miss Spider goes on adventures, like buying a car, trying to get someone to have tea with her, and getting married! And in the background, you may or may not notice that she has a partner named Holly (although she is front and center in the marriage story). I love that this book is about the character and doesn’t focus on her personal relationship even though it is there, no attention is drawn to it. This book normalizes same sex couples as though it’s a natural part of the story - and again, animals! Ferdinand is another teachable story - this one is more about passivism, but it shows kids that they don’t have to follow the crowd - and it’s ok if other people don’t want to participate. Everyone has their own style and way of doing things, and that’s ok! And animals!If you really want to get political, there are some AMAZING historical children’s books that focus on teaching kids about our diverse history. Two of my favorites are Of Thee I Sing by Barack Obama. It gives a brief history of many historical figures from all walks of life, and relates to how the reader can be strong, brave and powerful, just like the diverse group represented in the book. It also shows how many different kinds of people can contribute to something great. Let Freedom Sing is another informative one, the running hook in the book is the lyrics to “This Little Light of Mine” - in between the lyrics, the book talks about segregation and the people who helped move the civil rights movement forward. It is very direct, but a great launch point for conversations about the racial history of the United States.For kids between preschool and school age, informational and exploring books are great for budding young minds. National Geographic and Unicef have some great educational books for kids about different parts of the world. Children Just Like Me is a picture book that depicts life in countries all over the world and what it’s like for children living in different environments. Who’s in My Family is a book about all different types of families and how they are the same and how they are different. The Skin You Live In is a sing-song style book about all the different shades of skin you might see and loving the one you have.For older kids, there is a whole world of novels that talk about diversity. And most of them lose the animals. Here are a few of my favorites:The Who’s Who books are great for teaching about individual people, personalizing stories of struggle and diversity. Also historical, so educational!Books with strong female characters are hard to find, but I think they are really important not only for girls, but for boys too! You would never question letting your daughter read a book with a male protagonist, I think it should be the same in reverse. Pippi Long Stocking, Harriet the Spy, Matilda are all great choices. One Crazy Summer - about three young girls trying to find their mother in Okland in the 1970s - is also a great read.Perhaps my favorite children’s chapter book is The Miraculous Journey of Edward Tulane - about a beloved china rabbit who gets thrown overboard by accident on a cruise ship and is rescued and passed along to several different owners from different walks of life, including: orphans, a couple who’s child is grown, and a “hobo” in search of his son, and more. It’s heartbreaking and magical and the end will have you in tears. I love that it starts with a bunny who is privileged and spoiled and when his world is turned upside down (or overboard), he learns to find the beauty in different situations through different people and in the end realizes that everyone has a struggle and no one person is better than anybody else.Perhaps my ALL TIME favorite tip about teaching kids diversity through books is this: you don’t have to buy or find NEW books to teach your kids, try changing the books you already read! By changing the pronouns of the characters or modifying the story a bit, you can learn to see a book from a different point of view. What if the Very Hungry Caterpillar or Corduroy were girls? What if Trixie (from Knuffle Bunny) had two moms instead of a mom and a dad? What if Elephant and Piggie were a female-female couple? Or just girls who are friends! Try changing the background, motivations or gender of the characters - this is especially easy in books with animals!Books are an important way to expose children to a range of people, experiences, walks of life. There are really excellent options for all ages if you know where to look, and when all else fails, create your own diversity in the stories you’re already familiar with!For a more in depth list, check out: http://www.amightygirl.com/books which breaks down books by category, age, award winners, language, etc."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-can-I-start-exercising-regularly",
        "title": "How can I start exercising regularly?",
        "num upvote": 2,
        "answer": "By that I mean, what routine should I do? What schedule should I arrange? What food should I do?When I was young I HATED to exercise. I never played sports, am not athletic in ANY way. Now, at the age of (almost) 34, three kids later, I have a hard time NOT exercising regularly. So how did I get there?After my daughter was born eight years ago, my baby weight would NOT come off. And I love food. I was tired all the time and my body didn’t feel good at all. I started doing Mommy Yoga, I’d bring my daughter and we’d basically stretch around the babies and stop to nurse for half the class. It was a good start. When she got too big to take, I started doing regular yoga classes. I didn’t fall in love with it or do it regularly, but it was an introduction. I found something I could do and wasn’t too strenuous.After having my second child, I decided I needed to take exercise a bit more seriously. I started doing hot yoga (because I knew I was decent at yoga) a few days a week. The weight dropped pretty quickly.Then I found a workout program that I LOVED. It’s a program that incorporates yoga, cardio, weights, and heat. It sounds really miserable, and it was. But I was already familiar with yoga, so I knew I could do it. Getting through the weights and cardio was a challenge. But the hot room made me feel like I worked really hard even when I stayed in child’s pose for half the class. After going regularly for a couple of months I gradually got better and the weight started melting off pretty easily. Once I felt strong, I decided to challenge myself.For the year of 2013 (between baby #2 and #3), I decided to do 300 workouts in 365 days. I bought a 99 cent notebook, wrote each month on a different page and would write down what workout I did each day. It was challenging to find the time, but scheduling when I would workout a week in advance and coordinating with my husband, I was able to make it a priority. A lot of the classes I did were at 8 pm after the kids went to bed and some days I jogged one mile and that was my workout for the day. It averaged out to almost six days a week which isn’t sustainable for most working parents, but knowing it was just for one year made it more manageable and a goal I was excited to keep. Also, knowing I was working out so much meant there was less pressure to make each workout a hard one. Some days I would do a few reps of something in my living room and I had to be satisfied with that. Watching the pages in the notebook fill up was rewarding. When I hit my 100th workout, my halfway point (156th workout), my 300th workout, each milestone felt AMAZING. I still have this notebook and will look at it when I need inspiration or don’t feel like going to the gym.It was really hard, and I hated it for about eight months, but after a while, something started to change. I would feel tired and not good about myself on days that I didn’t work out. It became a habit.When I got pregnant with baby #3 I did not work out for my entire pregnancy. After he was born, I found it much easier to go back to the gym and working out because my body had become accustomed to it, even after nine months off.I don’t have the time now to workout six days a week, but the habit is there. Now I feel good and strong when I workout and I couldn’t imagine a week without a couple of good sweat sessions."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Im-pro-choice-and-pro-LGBT-Can-I-still-be-a-Christian",
        "title": "I'm pro-choice and pro-LGBT. Can I still be a Christian?",
        "num upvote": 5,
        "answer": "You can be whatever you want. That’s the beauty of free will. I will quote the brilliant Reza Aslan here from his recent Quora session:The truth of the matter is that scripture without interpretation is just words on a page. Every individual believer confronts his or her Scripture according to his/her or own preferences and biases. If you are a feminist, you will find plenty of things in your scripture to backup your view. If you are minsogynst you will find plenty to backup your view. If you are a violent person, you will gravitate towards the violent passages. If you are a peaceful person, you will gravitate towards the peaceful ones. The entire reason why these scriptures have lasted for thousands of years is because there is something in them to address every aspect of the human condition. But it is up to the individual to decide how to interpret the scripture, what to keep and what to change, what is important in their lives and what isn’t.[1]There are over two billion Christians in the world. [2]I am going to go out on a limb and guess that at least some of them are open to women having rights to their own bodies and people having the freedom to love/marry whoever they chose. In this modern world, it is not so strange to be more open minded. Because of technology, we are now exposed to more people/cultures/way of life than ever and the best way to be open minded is to be exposed to different kinds of people. Believing in God has nothing to do with that. Christianity is what you make of it. You can believe in God and not take the Bible literally. In fact, if Christians really did take the Bible literally, we’d be living in a very archaic world.No one can stop you from believing what you want to believe. And if you’re looking for like minded folks, trust me, they’re everywhere: The Christian Left, Jesus is a Liberal, Progressive Christianity."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Will-celebrities-run-for-President-after-the-success-of-President-Elect-Trump",
        "title": "Will celebrities run for President after the success of President Elect Trump?",
        "num upvote": 5,
        "answer": "In a recent interview, Oprah Winfrey was asked if she would consider running for president in 2020, to which she replied, \"No, that won't be happening, but I mean, I did used to think, well gee, you had to know so much more than I thought you had to know… That's what I thought. I thought, 'Oh gee, I don't have the experience, I don't know enough. And now I'm thinking, 'Oh! Oh.'\"[1]In the wake of a reality show, playboy, billionaire tycoon’s run and shocking win for the role of leader of the free world, we are left wondering… who’s next?It’s been discussed in so many threads on Quora that I won’t rehash what’s been said, but one of the many reasons Trump won the presidency was because if his outsider status. For some reason a large group of people felt as though someone with no experience would be best equipped to run the government. I will concede that our government has a fair number of “insiders” that are probably playing a different game than we would like them to be, but has electing a total “outsider”/celebrity really been successful? You don’t have to look far to see the list of gaffes Trump is making as a celebrity businessman who is trying to navigate a world he knows so little, if not nothing, about.So is there now a door open for celebrities to run for President? Sure, it’s a possibility. Do people now realize that an outsider - someone who maintains concerns about what Nordstrom sells and the ratings of a TV show - is probably not the best fit for the highest office in the US? I would hope so, but my guess there is no. People love the show. So who might we see running in 2020?Oprah is ready to throw her hat into the ring, and is probably the liberal equivalent of Donald Trump, so she could have a shot! And an Obama endorsement I’m sure.Here’s a list of other celebs that are thinking about a run: 6 Celebrities Who Might Run for President in 2020. Pretty scary/funny stuff. Imagine President Katy Perry. I’m sure we’d all be wearing crop tops and basking in the California sun in no time while the Conservative right protests the demise of modesty.Should celebrities even be involved in politics? It’s not always disastrous, for example, former SNL castmate Al Franken has done great things in the senate, despite his uneven record. [2]He has been putting the Trump administration to task, especially Jeff Sessions[3].Kal Penn has become more involved in politics since campaigning for Barack Obama in 2008 and was later offered the position of Associate Director of the White House Office of Public Engagement. In January 2016, Penn announced that he supported Bernie Sanders for the 2016 Democratic nomination.[4]And conversely, Republicans are not new to the game of celebrities gone politics. Most famously, actor Ronald Reagan became the 40th president of the United States and is now a Republican icon for conservative fiscal policies.Arnold Schwarzenegger became the Republican governor of California after an unprecedented recall election was held recalling Grey Davis. [5]Although this goals were promising, reviews of his job as governor weren’t stellar.[6]Have we become too celebrity obsessed? With the explosion of reality TV and the growing disinterest in politics, maybe these attitudes have misguidedly collided. Now we are living with the results and it’s not going well. But could it just as easily have gone the other way? Is it Trump’s lack of experience that is his downfall, or his conservative politics? Perhaps only time will tell. And whether or not we’re willing to take another chance on a celebrity president is TBD."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-much-better-will-the-Willow-Smart-Breast-Pump-be-to-use-than-other-breast-pumps",
        "title": "How much better will the Willow Smart Breast Pump be to use than other breast pumps?",
        "num upvote": 8,
        "answer": "Willow's smart breast pumps slide into moms' brasI used a breast pump daily for all three of my children - my first child was actually exclusively pumped for, as the stubborn child refused to latch. Anyway, my point being is that I am somewhat of an expert on this archaic technology that we currently use known as the breast pump. The pump that I used for seven years was this one, the Medela Pump In-Style Advanced. Unshockingly, in the six years between the birth of my first and last child, that remained the best pump for moms on the go. Not only was the thing hideous and horrible to use (see Alecia’s answer here), it wasn’t cheap! I know a lot of medical insurers cover the cost of breast pump rentals which I think is great (although I’m sort of skeptical that they also use that as an excuse to pressure women to breast feed that can’t or don’t want to), but that’s a whole different discussion.The breast pump I used was atrocious and I often joked that if a man had to breast feed, this technology would have been advanced AGES ago (or as my husband astutely pointed out, the pressure to breast feed would likely not be as great). In order to use it, I had to have a huge cover or expose my boobs, or sit away from everyone alone for 30 minutes at a time. It hindered almost everything in my day as pumping has to be done on at least a somewhat regular schedule and stopping everything to do it, and not just do it, but sit down, away from everyone, whip off your top and hold these things up (hands free pumping bras came in handy when you could get them in the right spot) and listen to this extremely loud and clunkly machine pump your breasts uncomfortably, was quite an event. Usually this has to be done every 2–6 hours depending on how old your child is. That is a HUGE inconvenience for nursing moms.When I was pregnant with my third (and final) child, I read this article: Building a Better Breast Pump and it gave me hope. FINALLY the industry was taking this challenge seriously and was willing to do something about it! I don’t know why it took SO long, as the article states, “Granted, consumer breast pumps are relatively new; the first pump that wasn’t intended for hospital use was introduced in 1991.” That’s TWENTY FIVE YEARS. That’s a long time. Drew Smith has a great blog post where he details scientific advancements that were made relatively quickly that I will link HERE just to show that science and technology CAN work fast when they want/need to. Clearly this wasn’t a top priority for anyone… until now.Willow, the company that is manufacturing this new, better version of the breast pump, seems to be on the right track. Although still a bit clunky, it looks as though they triple the size of your boobs, it’s hands free and much more discreet. The bags being inserted into the apparatus is also helpful as you don’t have to attach bottles. And the integration of technology (an accompanying app!) makes it much easier to integrate into our already technologically advanced lives. I think Willow is going in the right direction, however, I think this is the pump we needed 10–15 years ago (sans app obviously). The industry still has a long way to go on this, but I’m glad companies like Willow are beginning to take those steps.Other companies also show promise for advancing pumping technology, The Naya Smart Breast Pump and A smart breast pump by Moxxly are among companies looking to make pumping easier.Women today are taking on more than ever before, according to the US Department of Labor, 58% of women are working or actively looking for work[1], the highest percentage we’ve ever seen[2]. 70% of all mothers (with children under 18) in the US are part of the workforce. [3]Paired with this information (from the Atlantic article referenced above):The World Health Organization recommends breastfeeding for the first two years of a child’s life; the American Academy of Family Physicians recommends it for at least the first year. While breastfeeding rates are on the rise—79 percent of newborns start on breast milk, according to the Centers for Disease Control and Prevention’s 2014 Breastfeeding Report Card—less than half of those babies are still breastfeeding at six months.[4]It’s no wonder modern moms are feeling more and more pressure to breast feed AND work - hence the immense need for a pump that works for the working mom. Technology needs to catch up!On another note, with a Trump presidency and a likely repeal of Obamacare, there’s no saying what insurance companies will do in the future for pumping moms, but the quality and price of pumps isn’t likely to get better:“Ironically, the Affordable Care Act, which requires coverage of breast pumps, might push the technology into an even worse space, Holtzman notes. The client is no longer the mom that uses the technology, but the insurance company that’s paying for it, and the insurance companies’ main concern is cost, not functionality.”[5]"
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/With-Trump’s-victory-who-will-lead-the-Democratic-party-now",
        "title": "With Trump’s victory, who will lead the Democratic party now?",
        "num upvote": 13,
        "answer": "Will the Clintons continue to be a force in the DNC or will they and/or their followers be pushed out?Will Obama take on the leadership role as the opposition party? It appears he assume HRC would win and he would take a back seat. Someone else?There are so many promising Democrats that are ready to take over the DNC and reinvigorate the party after our sorry loss this year. I think one thing is clear, we need someone young, different, and not part of the political machine. As many publications reported, Millennials did not come out to vote for Hillary[1]. So who might they turn out for in 2020? Here are three up and comers we should be keeping our eyes on.Keith Ellison: Ellison is from Detroit and is a five-term congressman from Minnesota and is the first Muslim man to be elected to Congress. He scandalously took his first oath of office on the Koran.[2] “Ellison is a co-chair of the Congressional Progressive Caucus and a Chief Deputy Whip, and also serves on the House Committee on Financial Services.” He’s from the rust belt, an area that was supposed to go to Clinton in the 2016 election but shockingly went to Trump (likely due to his anti-trade, anti-globalization message to blue-collar workers and the weakening labor movement[3]). He backed Bernie Sanders in the 2016 election, a man many say could have beaten Trump in the election because of his outsider status and hopeful message to those who have suffered due to deindustrialization and outsourcing - a message that Clinton lacked[4]. He was a vocal critic of President George W. Bush and lead the charge to impeach Dick Cheney and was adamantly against the Iraq War. His platform is to “focus on wages, housing, \"relief and justice for the middle class.” A message that is popular among Democrats and the working class, a population that did not fully get behind Hillary.See him in action here: KEITH ELLISON DNC SPEECHKamala Harris: Harris has served as the Attorney General of California for the past five years and was recently elected Senator of California becoming the first Indian-American and second black woman elected to serve in the United States Senate.[5] She has been tough on gun control[6], opposes the death penalty[7], and has written a book Smart on Crime: Kamala Harris in which she examines “criminal justice from an economic perspective and attempts to reduce temptation and access for criminals. The book goes through a series of \"myths\" surrounding the criminal justice system and presents proposals to reduce and prevent crime.”[8]She’s also a friend of the LGBT community and created a special Hate Crimes Unit[9] during her time as San Francisco District Attorney and is an advocate for women’s rights[10]. She has been endorsed by many dominant Democrats in Congress as well as Barack Obama and Joe Biden. Obama even starred in an ad endorsing her for her Senate seat in 2016[11]and once called her “the best looking attorney general.”[12]See her in action here: KAMALA HARRIS DNC SPEECHCory Booker: Booker is a US Senator for New Jersey. He is a Rhode Scholar and has a JD from Yale University[13]. He became notable for his political career as the Mayor of Newark from 2006–2013. During his time there he embarked on an ambitious 100 day plan that included reducing crime, “helping families, improving citizen access to services and refurbishing or replacing some of the city’s nearly century-old police stations. He also said he would focus attention on helping former convicts get jobs.”[14]During his term as mayor, he reduced his own salary and raised the salary of many city workers. He also held open “office hours” where residents could come and talk to him about issues that were on their minds. [15][16]On social issues, Booker supports abortion rights, affirmative action, and same-sex marriage. He supports ending the War on Drugs. On economic issues, he supports long-term deficit reduction efforts to ensure economic prosperity, Cap and Trade taxation to combat climate change, and increased funding for education. Booker is a supporter of the DREAM Act and the Patriot Act, stating the abolition of the latter would be \"a little irresponsible\", although he does support some reform of it.[17]I mean, he even saved a woman from a burning building once.[18] No joke. And shoveled snow from a constituent's driveway[19] and invited victims of Hurricane Sandy to come stay at his home. [20]See him in action here: COREY BOOKER DNC SPEECH"
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-are-the-best-home-organizing-and-cleaning-tips",
        "title": "What are the best home organizing and cleaning tips?",
        "num upvote": 126,
        "answer": "I have three kids, my husband and I both have jobs and we have no childcare help. Our house is always clean (well, not every second of the day, but most of the time).Here’s how we do it:Schedule: Every morning we make all of the beds. My oldest is old enough to make her own and we always make ours. We unload the dishwasher and clean up all of the breakfast dishes before leaving for school/work.Usually we’re gone for the day, but whoever is home will clean up anything left out before the baby naps in the afternoon.As soon as we come home from school/activities, the kids bathe while I make dinner. We have a centrally located hamper where everyone’s clothes go. After eating, the kids clear their plates and we load up the dishwasher and clean up together. I have the kids sweep up crumbs or vacuum with the hand can under the table. We wipe down the table at the end of the day.Before they go to bed the kids will clean up any toys they’ve played with and I will tidy up anything I’ve left out.A couple times a week I will vacuum the living room and wipe down the bathroom sinks.Once a week I dust everything, clean the toilets, mop the floors and get rid of anything laying around. This usually takes 2–3 hours.Simplify: Everything in our house has a place. If it doesn’t have a place, it gets thrown out (or sometimes put in the garage). We clean as we go and I don’t let the kids pull out more activities until they’ve cleaned up what they have out.A mail organizer by my desk helps with forms, mail, bills, letters, etc. that are incoming and outgoing.A corkboard in the laundry room is great for kid art/calendars/projects we want to keep.Don’t sit until it’s done: It’s really easy at the end of the day to say, “I’m tired, I’ll do it tomorrow.” Putting in a little extra time up front will save you extra work on the backend. Letting things pile up over time will become overwhelming and you won’t get around to it. I never go to bed until everything is put away.Don’t be afraid to get help: After having our third kid I realized I couldn’t dedicate the time to deep cleaning that I once did, so we hired someone to come do a good scrub of the house every two weeks.Tackle that pile: Even in my organized house things can pile up. I take a few hours every month to go through the kids closets, the stack of mail, the shoe pile outside the front door, etc. and get rid of anything not needed and reorganize what’s left.Laundry: With a family of five, laundry is a CONSTANT chore, it never ends. We have one hamper and when it’s full (every 2–3 days), I do the laundry. I try to do it early in the evening so when the kids go to bed I can fold it all while I watch TV. I stack it up and put it all away the next day. Because I do it so often, it doesn’t take more than a few minutes to put away.Spontaneous cleaning: When I notice toothpaste in the sink or crumbs on the kitchen floor, even if it’s not a scheduled time to clean, I will take care of it right away. Leaving it only makes me feel overwhelmed and clearing time on the calendar to tackle it all is not always feasible. I know if I take care of it in the moment it won’t linger as a chore that needs to get done and the house will always feel somewhat clean.Obviously these things aren’t doable for everyone, but this is what works for us. Cleaning as we go, involving the family and making tidiness a priority are major factors in keeping our house clean. Don’t be intimidated by putting in the work every day, it will be worth it.If your house is already a mess, take one weekend, or one day each week for a couple of weeks and just go through everything that’s piled up/messy and start over. Once you get things the way you want them, it will be much easier to maintain, it just takes time to get there.And if you are ok with a messy house or having things not be tidy all the time, that’s ok too! Personally, I envy people who can tolerate a little bit of mess.For more on how to stay organized with kids, you can see my answer: Adrienne Gomer's answer to What are some parenting tips that make life with kids easier?"
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Did-you-take-your-husbands-last-name-when-you-got-married",
        "title": "Did you take your husband's last name when you got married?",
        "num upvote": 22,
        "answer": "I find the idea of women changing their last name’s really antiquated. But I did it, and I support any woman that does. Here are the reasons I did it:I do sometimes regret it though, I REALLY don’t like the name Gomer. No one pronounces it correctly and you always get the Gomer Pile jokes (on top of the “YO ADRIAN!” jokes, it gets to be a bit much). My maiden name, O’Brien, is a strong, relatively normal name and I wish I would’ve kept it.I also think it’s way more common now for women to not change their names so the parent/child last name disconnect is not as big of a deal as it was when I was growing up. Or maybe it’s just where I live?I am also baffled as to why, when women decide to keep their maiden names, they then give their children their husband’s last name? Can anyone clarify why this is the case?I’d like to think that we’re moving past gender roles (HA! I’m sure we are so far from it, it’s not even funny - hello 2016 election!), but I have a hard time seeing why a man’s surname is more important than a woman’s.I have friends (two women) who have children and are married and came up with their own last name which I think is a great solution.I really think to each his own, but I’m fascinated as to why we carry on this strange tradition."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Will-the-recent-anti-Trump-protests-be-able-to-achieve-anything",
        "title": "Will the recent anti-Trump protests be able to achieve anything?",
        "num upvote": 4,
        "answer": "I mean, will the protests be able to remove Trump as President? Apart from expressing anger and dissent, what are the protests trying to achieve?I hope they inspire all of the Democrats, Independents, etc. who didn’t come out and vote in this election to not sit by another election again. I hope if anything it rallies the majority of the country that did NOT vote for Trump to make change whether it be donating time, money, whatever it is to support causes that Trump has promised to fight against. We can use our voices for good, it is a Democracy after all and we have the final say."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Are-protests-against-Trumps-presidency-justified",
        "title": "Are protests against Trump's presidency justified?",
        "num upvote": 61,
        "answer": "I mean, he was elected in a democratic way even though few people saw it coming. Maybe Hillary Clinton was a better candidate, but he is the president now. Why these protests, then?P.S. Before you judge, please note that the OP is not American, and is just curious.Absolutely. Protests give a voice to those who feel marginalized and unheard. Usually protests are in response to some sort of event or policy that a large number of people disagree with. I think this case applies.The African-American Civil Rights Movement was largely demonstrated through protests. We are now left with images of people being hosed, arrested, attacked by dogs. This had an impact. Although we still have a long way to go[1] when it comes to race in America, it definitely imprinted the movement in people’s minds and has continued to be a powerful source of protesting[2] in our country, and has brought about some good change[3] (although I would argue, not enough… yet).Trump has made the following statements:“An ‘extremely credible source’ has called my office and told me that Barack Obama’s birth certificate is a fraud”“You know, it really doesn’t matter what the media write as long as you’ve got a young, and beautiful, piece of ass.”“I will build a great wall – and nobody builds walls better than me, believe me – and I’ll build them very inexpensively. I will build a great, great wall on our southern border, and I will make Mexico pay for that wall. Mark my words.”“When Mexico sends its people, they’re not sending the best. They’re not sending you, they’re sending people that have lots of problems and they’re bringing those problems with us. They’re bringing drugs. They’re bring crime. They’re rapists… And some, I assume, are good people.”“Our great African-American President hasn’t exactly had a positive impact on the thugs who are so happily and openly destroying Baltimore.”“I have so many fabulous friends who happen to be gay, but I am a traditionalist.”[4]\"Donald J. Trump is calling for a complete and total shutdown of Muslims entering the United States until our country's representatives can figure out what the hell is going on.\"[5]The fact that a good part of the country just elected someone who has offended immigrants, African Americans, women, Mexicans, gay people and Muslims makes a lot of people scared. There are very large pockets of the country who do not agree with Trump and are ready to fight him on any hateful promise he hopes to fill.Already we are seeing the effects of a Trump presidency[6] and it’s frightening for a lot of people.The protests are America’s way of saying: Donald Trump, we hear you and we don’t accept you and we are ready to fight against you. You will see us and you will hear us and we will not back down.It’s a way of telling the people who feel lost, forgotten and targeted that they have allies that are ready to fight with them and for them. It’s the physical manifestation of this important statement made by California law makers.We are already realizing by the numbers that a main reason Hillary lost is because the Democrats who share these values didn’t come out to vote[7]. Perhaps these images will inspire the change we need.You can see a protest on TV and in pictures, for all of history. You can see people who are ready to fight for what they believe in and to me, that’s a beautiful image and completely justified."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-should-parents-explain-Donald-Trump-getting-elected-to-their-children",
        "title": "How should parents explain Donald Trump getting elected to their children?",
        "num upvote": 90,
        "answer": "Curious about the themes and overall narrative. Would be great to get perspectives from both sides.This is a really hard one and I can’t think about it without getting teary.Here is a picture of me voting with my two sons on election day along with my caption:“Women are natural feminists, I have a daughter and through her life experiences and the way we raise her, I am confident that she will be a strong woman. More importantly (to me) is to raise my SONS to be strong feminists. Women will stand up for themselves, but unless we raise men who will stand up for them too, there is no hope.”I also have a daughter. She’s old enough to understand this and was brimming with hope that she’d see someone like her, a female, in the highest office of the US. Someone who would champion her rights and fight for things that she believed in too. That night our house was tense, we tried to keep things light and cheery as we ate dinner and tucked our kids into bed. Luckily the doom didn’t come until after they were fast asleep. The moment the news reported that Hillary called to concede, I couldn’t keep it in any more. I bawled, I was shocked, I was so sad. Not only for the millions of marginalized people in this country who are being told that their lives are worth less than ours, privileged white Americans, but for my daughter. I knew when she woke up that I would have to tell her that the bad guy won. That our country let her down. That as a nation, we decided that this fear mongering, hateful bigot who spewed horrible promises across our nation, that the country chose him over a qualified, hard working woman.These were my thoughts, obviously, I did not paint such a grim picture for her in the morning. Here’s what I did say:“Guys, guess what? The bad guy won. The guy who is mean to women and people of color, they said he should be president! Isn’t that crazy? On behalf of good adults everywhere, I’m sorry we let you guys down. I’m sorry we didn’t do better for you. I know you guys have good hearts and will make some great change in this world and I promise that I will spend every amount of energy I have for the next ten plus years (until they are adults and can exercise their own voices) to making this country a better, more inclusive place so that when you’re ready to take on the world, it’s ready for you.”And from there we practiced our speeches for our 2048 Gomer/Gomer ticket. On the agenda? Providing food for everyone (Leo’s idea). I’m hopeful for our future.Addition: Another thing that gives me hope is this map showing people aged 18–25 and how they voted. A lot of people will say it’s misleading because Trump got 1 million votes less than Romney did in 2012 and Clinton got 5 million less than Obama did in 2012 ,[1]meaning Millennials did not turn out to vote in ways they have before. We need to mobilize the youth vote, the way Obama did, if we really want to see change and that starts with our kids.And one last piece that gives me a small ray of hope for this country: Only 55.6% of voters exercised their right to vote. There are 218,959,000 eligible voters in this country. Only 128,843,000 people actually voted in this election. Of those 59,418,103 voted for him. So only 27.14% of eligible voters actually elected this disaster. Trump does not represent the majority of Americans. Let’s show him that."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Whats-the-mood-in-the-USA-now-that-Trump-has-been-declared-victorious",
        "title": "What's the mood in the USA now that Trump has been declared victorious?",
        "num upvote": 43,
        "answer": "Donald Trump wins presidential election, plunging US into uncertain futureI think Van Jones said it best.“People have talked about a miracle ― I’m hearing about a nightmare. It’s hard to be a parent tonight for a lot of us. You tell your kids, ‘Don’t be a bully.’ You tell your kids, ‘Don’t be a bigot.’ You tell your kids, ‘Do your homework and be prepared.’ Then you have this outcome, and you have people putting children to bed tonight and they’re afraid of breakfast. They’re afraid of, ‘How do I explain this to my children?’ I have Muslim friends who are texting me tonight saying, ‘Should I leave the country?’ I have families of immigrants that are terrified tonight. This was a whitelash against a changing country. It was a whitelash against a black president in part. And that’s the part where the pain comes. And Donald Trump has a responsibility tonight to come out and assure people that he is going to be the president of all the people he insulted and offended and brushed aside. Yeah, when you say you want to take your country back, you got a lot of people who feel that we’re not represented well, either. But we don’t want to feel that someone has been elected by throwing away some of us to appeal more deeply to others.”On a personal note, explaining this to my children, apologizing to my daughter that the country let her down as a female and then trying to show them optimism and that the world will be ok has been by far the hardest thing I've had to do as a parent.Hillary’s concession speech was heartbreaking for so many reasons. In there she talked about optimism and encouraging young girls to fight for what’s right. I had a really hard time swallowing that piece of advice when the country just told our young daughters that a man who is so full of hatred, misogyny, racism, bigotry (just to name a few) is more important than they are. We are sending the wrong message to our LBGTQ family, our children, women and minorities all over the country who rely on us to do the right thing. It is shameful and sad.Many people will speculate for a long time about why this has happened. My best guess is that the racists of this country have had enough of a black man in office and came out in droves. The Democrats had a candidate that they couldn’t fully support and who didn’t win the nomination her first time running. The fact that she won the popular vote is promising, but unfortunately doesn’t change the outcome.We have a lot of work to do to repair this. Good luck America."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-do-I-create-a-safe-and-loving-home-for-my-kids",
        "title": "How do I create a safe and loving home for my kids?",
        "num upvote": 9,
        "answer": "There are so many ways to create a safe and loving home for children. There are thousands, perhaps millions, of different ways to successfully raise a child and there is no one-size-fits all method to do so. Given that caveat, here are some things that might help provide some nurturing environments for young ones:Be consistent - Children grow up relying on you, for well, everything! Showing them that you are going to do what you say you are going to helps to reassure them that you’ll always provide what’s promised. Follow through whether it’s on a punishment or a fun plan. Having predictability is key for making kids feel safe.Be compassionate - Being a parent is hard! Sometimes your kids will say and do things that will make you mad, annoyed, sad, etc. Always try to remember that YOU are the parent and THEY are the child and do your best to see every situation from their perspective. Your experiences as an adult don’t necessarily translate to a child with a very limited world view. Remember, they are a kid that needs you. One of the best ways to provide a safe and stable space for a child is to show them that you understand them, that you are willing to hear them and that you don’t judge them. In addition, showing other people compassion in a similar manner sets a good example on how they should treat people.Set an example - Be the sort of person you want your kid to be one day. Kids won’t hear everything you say, but they will see everything you do. Taking care of yourself, taking care of others, being responsible, being spontaneous, being silly, these are all things that are important for a kid to see adults doing. You’re showing them how to be an adult… an adult that can be a parent and a regular person. Which brings me to my most important piece of advice…Be human! We all get mad, we all get sad, we yell, we laugh, we fight. It’s important that kids see this side of you! If you are having an argument, with a spouse for instance, don’t take it behind closed doors (unless it’s serious or cannot be resolved civilly), work it out. Talk about it in front of your kids, show them that you can work through problems and move past them. If you get mad and yell at your kids, or say something you regret, it’s ok! Apologize and explain that adults feel things too and sometimes they don’t handle it as well as they wish they did, but it’s important to acknowledge when you’ve hurt someone or made a mistake.Being a consistent, normal human being who experiences feelings and makes mistakes is a great way to show kids stability and love. They know that you’ll always be there and show them how to handle difficult situations. Allowing them to see every side of you and open up all lines of communication on every topic shows the deepest depths of love. You are there unconditionally and you’re willing to do life with them."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-does-co-sleeping-impact-an-infant’s-health-and-development",
        "title": "How does co-sleeping impact an infant’s health and development?",
        "num upvote": 30,
        "answer": "A good answer will cite relevant research.With the American Academy of Pediatrics recent update on healthy sleep guidelines[1] for infants and toddlers, the ever controversial subject of co-sleeping is back in the news as people continue to have differing thoughts on the subject.The Risks:According to new findings, the AAP now recommends, “Shar[ing] a bedroom with parents, but not the same sleeping surface, preferably until the baby turns 1 but at least for the first six months.”[2] This isn’t necessarily co-sleeping, but it does bring up an important point. Scientific findings show that having parents close by is better for a baby’s health while sleeping. But why? “There is evidence that sleeping in the parents’ room but on a separate surface decreases the risk of SIDS by as much as 50%.”[3] Having the child close by allows for parents to be more alert when their child is sleeping in case there is a hazard that could cause SIDS. But why not in the bed? “It is important to note that a large percentage of infants who die of SIDS are found with their head covered by bedding.”[4] The AAP recommends having the child nearby with no extra bedding on a firm mattress.The studies and health findings on SIDS makes this recommendation make sense. 3,500 infants die each year from SIDS (down 50 percent since the AAP introduced their Back To Sleep Campaign in 1994[5]), but that’s still a shockingly high number. So we know the health risks involved in co-sleeping, but what about the other factors?The Benefits:In most of the world, co-sleeping with infants is the norm. According to the Natural Child Project, “Only in the past 200 years, and mostly in Western industrialized societies, have parents considered it normal and biologically appropriate for a mother and infant to sleep apart.”[6] And for good reasons! It allows for parent/child bonding, more rest (in most cases) for the parent, especially if breastfeeding, and provides the child with comfort, allowing them to fall back sleep easily when woken up[7]. As a new parent, with the around the clock needs an infant requires, co-sleeping seems to be a natural way to address those needs without disrupting the regular night-time routine we all need to feel rested. Having your baby in another room means that you likely won’t hear them until they are crying, now fully awake, and will require you to get up and address the problem. However, every child is different and some do okay without a parent nearby.I have three children and they all had really different needs as infants. My first child slept in a bassinet near our bed for three months and went off to her own room without any issues. My second child was really fussy and would not sleep on his back, despite AAP recommendations (those stubborn kids!), so I would feed him and sleep with him in my arms, propped up, in our bed, nursing intermittently, and it worked for about four months until we transitioned him to his own room. My youngest child slept upright on his back in a Rock ‘n Play next to our bed until he outgrew it at around six months, then moved to a bassinet in our room until he was fifteen months. It’s also worth noting that for us there was no correlation with sleeping through the night and sleeping in our room as they all slept through the night at different ages.On the flip side of hard-tested science, Attachment Parenting International recommends co-sleeping for the following reasons:“Babies have needs at night just as they do during the day; from hunger, loneliness, and fear, to feeling too cold or too hot. They need the reassurance of a loving parent to feel secure during the night… Parents who are frustrated with frequent waking or who are sleep deprived may be tempted to try sleep training techniques that recommend letting a baby cry in an effort to \"teach\" him to \"self-soothe\". New research suggests that these techniques can have detrimental physiological effects on the baby by increasing the stress hormone cortisol in the brain, with potential long term effects to emotional regulation, sleep patterns and behavior.”[8]*So pretty scary stuff coming from both sides, right? We know the potential risks of co-sleeping, although some studies suggest that if done correctly, co-sleeping can be safe[9]. And we know the potential risks of not co-sleeping.Long Term Effects:Currently the AAP does not do long term studies on co-sleeping, but there has been some research done that takes a look at the long term development of children who co-sleep and children who do not. Studies have been done that show that co-sleeping, for children, can increase overall confidence, reduces anxiety in adult intimacy, and contributes to an overall sense of life satisfaction.[10] It also promotes synchronization and around the clock acceptance by the parent of the child, resulting in a deeper connection when it comes to basic needs.But it’s not all sunshine and roses. This article takes a look at the more short term side-effects of co-sleeping that most people don’t talk about, including, uncomfortable sleeping positions as the child gets bigger, leaky diapers, illnesses, and the effect it will undoubtedly have on your sex life. Overall contributing to less quality sleep for parents as the child grows.So What’s the Solution?If you’re a parent, you already know that every decision you make will be scrutinized. Now more than ever, scientists, doctors, fellow parents and researchers are telling you the best ways to care for your child. Yes, SIDS is always a risk, but it’s a risk whether your child is in your bed or not. Let’s not forget that co-sleeping is not even a main cause SIDS deaths[11][12].The best thing you can do for your child is whatever feels right for you. There are risks and benefits with everything that you do. If your child is a fussy sleeper and sleeping separately is not working, then try co-sleeping (safely). If you aren’t sleeping well with your child in your bed, try moving them to their own room. This article has some really good tips on how to do that. If your sleeping arrangement works for you, then keep it! There is no one-size-fits-all model to sleeping with or without your kids. Believe me, I know from experience.If you’re looking for a safe compromise, these co-sleepers are regulated by the Consumer Product Safety Commission and are considered a safe alternative for parents who want their babies nearby but not in their beds. Be warned, the bedside co-sleepers are regulated, but the in-bed co-sleepers are not[13]*The AAP actually refuted the long term negative effects of cortisol on babies during sleep training and actually states that sleep training is scientifically safe.[14]"
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Can-anyone-share-pictures-of-a-parent-and-child-who-look-extremely-alike",
        "title": "Can anyone share pictures of a parent and child who look extremely alike?",
        "num upvote": 72,
        "answer": "I would also be curious to see pictures of parents and their child who look nothing alike!I have three kids and my youngest and oldest look a LOT like me.The oldest on the left, me on the right.Me on the left, the youngest on the right.My middle one looks a lot like my husband, but my husband has black hair and brown eyes and my son has light brown hair and blue eyes, so he doesn’t get a lot of recognition in the gene pool."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-do-I-get-my-child-into-a-good-sleeping-routine",
        "title": "How do I get my child into a good sleeping routine?",
        "num upvote": 4,
        "answer": "This is something ALL parents struggle with. I have three kids and they are all REALLY different sleepers (my first was a great night sleeper but never napped well, my middle one took really long naps but was a terrible night sleeper and the third one is just ‘meh’ about sleep in general). Now, at ages 7, 4 and 1, they all sleep pretty well, and two of them share a room! Here are three tips that really helped me:"
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-do-you-explain-arrogance-to-a-kid",
        "title": "How do you explain arrogance to a kid?",
        "num upvote": 6,
        "answer": "With everything, make it age appropriate. I would say something like this:“Some people think they are better than other people, or that they do things better than other people. Sometimes it’s true and sometimes it’s not, but when people say it and share it with others, they often do it to make others feel bad and make themselves feel better. It’s not good to hurt people that way - just so you feel better about yourself. It’s much better to appreciate everyone’s capabilities and celebrate all of our achievements equally.”"
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Can-parents-be-envious-of-their-childrens-smartness",
        "title": "Can parents be envious of their children's smartness?",
        "num upvote": 5,
        "answer": "Definitely! I am in awe of my daughter every day. She’s still very young, but she grasps things I never would have at her age. It’s quite amazing to watch and it makes me really really proud. If there’s one thing I want for my kids, it’s for them to be better people than I am. One thing I really want my children to be is smart, because with knowledge comes wisdom and compassion. The more you know, the better decisions you make, with your life and what you do with it and how you see the world.So yes, I’m envious of my child’s “smartness” and I wouldn’t have it any other way."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Why-are-so-many-parents-unprepared-to-raise-their-children",
        "title": "Why are so many parents unprepared to raise their children?",
        "num upvote": 6,
        "answer": "I reflect back on my childhood and I can honestly say that my parents are complete idiots who never should have raised us. The state should have come in and taken me away from them. Currently, I suffer many emotional problems and have many mental issues due to their abuse upon me.I’ll tell you a secret - no one is ever prepared to raise children. Nobody. Ever. Even if you have a billion dollars in the bank, you’re a preschool teacher, you’ve been trying for years and have wanted it your whole life, I promise you, you are not prepared to raise children.The truth is that until a tiny human (that is half you and half someone you love - hopefully) comes into the world and takes their first breath, there is absolutely no way to prepare for the weight and responsibility and pure love that comes with being a parent. From that point forward, every decision you make in your life is going to involve someone else. You can’t divorce a child, they’re there and they rely on you and will, likely forever. Your life isn’t just yours any more and there’s no way to prepare for that. You can imagine what it will be like, but there’s no way you will know how it feels until it happens.The other factor is that every child is a unique individual, there’s no way to prepare raising a child who’s personality you have no clue about. I can tell you that of my three children, no two are even remotely similar and we have to handle each one differently. There’s no way we could have known any of that before they each came and shook up our lives.Raising a child is the hardest thing you can possibly do, there’s no one right way to do it, and there are a lot of ways you can really mess up. It’s really tricky and something you have to balance every single day. I’ve only been a parent short of eight years and there are so many mistakes I know I’ve made, but the only thing I can do is move forward and do the best I can.Your children are the legacy you’re leaving in the world when you’re gone - it’s a lot of pressure to try and raise a child that will make a positive impact in the world. Instilling the right values, making sure they are a kind, compassionate person, perhaps teaching THEM to be a parent one day… it’s a lot of work, it’s a life’s work and it’s something you should never take for granted. Try to prepare for that."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-are-some-of-the-best-ways-to-raise-your-child",
        "title": "What are some of the best ways to raise your child?",
        "num upvote": 2,
        "answer": "There is no answer to this. You do the best you can. You be there for them, keep them safe, fed, clothed and clean. Make sure they don’t grow up to be assholes (usually this involves teaching empathy). That’s really it. Never be afraid to ask for help! No one can do it alone."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Is-it-possible-to-manage-kids-aged-6-and-3-plus-a-newborn-without-a-full-time-helper-at-home",
        "title": "Is it possible to manage kids aged 6 and 3, plus a newborn without a full-time helper at home?",
        "num upvote": 3,
        "answer": "Yes, but probably not as a single person. Unless you are independently wealthy and have the freedom to play with three small children and have zero financial worry! In which case I really really envy you.Right now I have a 7, 4 and 1 year old, so a year ago… I was there. It was really, really, hard. I think the most important thing to have is a supportive partner or family member who can help. If you need to work, it will be difficult to do it all alone. If you don’t work (outside of the home), you will burn out providing all of the childcare and will become overwhelmed at some point (everyone does).The hardest thing about the ages 6, 3 and a newborn is that they all have REALLY different needs. The six year old is learning about the world and has a LOT to say and a LOT of questions I’m sure. The oldest will likely get the least attention and you’re going to have to make peace with that. Having a third child meant that the oldest had to learn to pack her own lunches, make her own bed and get herself dressed in the mornings. It might be hard to put this on your first baby and there will be a grieving period where you’ll miss having to only divide your attention one or two ways. Get over it. The faster you do the better.One thing that really helped me was to keep reminding myself that parenting is hard for everyone. Even for people who seem to have it all together. Also, “parenting” as we see it is a relatively new concept and more pressure has been put on women than ever before to do it all (since the 1970s and 80s when women began working more outside the home than ever). You’re doing fine, and the fact that you even care makes you a better parent than any parent in any generation before yours. Kids are super resilient. They don’t need your full attention all the time. Allowing them to take care of things, be involved, have responsibilities, will be so good for them in the long run.The middle child will really get the short end of the stick. Unfortunate, but a cross they must bear. The three year old has all of the same questions a six year old does, but has less world context… and still needs a lot of physical help. The three year old is the most work. They’re learning to assert themselves and gain independence, however, they still need so much from you as a parent mentally and physically that it can be overwhelming when you also have a newborn. But people do it, and get through it, all the time. You aren’t the first. It’s ok to get frustrated, but do your best to communicate to the three year old what’s going on and why they can’t have your full attention. Expect outbursts.The baby is the most exhausting. You’ve been here before. Physically they need attention 24/7 and it’s nearly impossible to keep up with when you have other children who also need you. It’s ok to let the baby cry. It’s ok to pick them up when they cry. There’s no wrong answer. Do whatever will keep you sane. My second and third child definitely were left to cry on more than one occasion so that I could do things like eat and shower. And they’re completely fine now and love me more than anyone… I think. So no long term damage was done.It’s important to remember that it’s all temporary. Your kids will be big and independent before you know it and they won’t need you as much. These are the trenches, this is the worst it will get. It’s hard, it’s exhausting and you WILL cry. But it’ll all be over before you know it."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Needs-More-Information-Why-do-some-parents-allow-their-minor-daughters-to-dye-their-hair",
        "title": "Needs More Information: Why do some parents allow their minor daughters to dye their hair?",
        "num upvote": 13,
        "answer": "Because hair grows back. Dying your hair is a really fun, temporary change that has zero long term consequences. It’s also a dangerous message to send to your daughter that her hair is so important (because girls are often taught to value their looks above all else) that you can’t dare change it."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Is-it-strange-for-someone-to-not-want-kids",
        "title": "Is it strange for someone to not want kids?",
        "num upvote": 5,
        "answer": "Whether they don't want kids for a reason that they can't explain, have a genetic issue that they don't want to pass on, want to do other things with their time and money, or whatever else, is it weird for people not to want kids?Not at all. Kids are a LOT of freaking work. The rewards are incomparable but I can completely understand people that are not prepared to have their worlds flipped upside down.The minute your child is born, your entire world changes. Your life isn’t about you anymore and every breath you take is for the sake of a helpless being that you are responsible for into adulthood. Having kids means spending the largest chunk of your entire life caring for someone else. That is the biggest commitment a person can make.We only get one life and for many people having children is a big part of their life’s goal, but for many people it’s not. Those people have the freedom to pursue passions at their will, travel, work, not work, whatever! As a mother of three sometimes I think a life like that would be pretty amazing.I am someone who has always wanted kids (and a lot of them), but I stopped at three, because it’s so goddamn tiring. It’s worth it for me in the long run to have these beautiful, kind hearted children that I will leave in the world who I can pour my ideals into and will maybe one day make their own mark on the world. But fuck if sometimes I don’t wish I could take a last minute vacation… or at least not be responsible for wiping so many asses."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-do-you-prevent-raising-a-baby-that-cries-all-the-time",
        "title": "How do you prevent raising a baby that cries all the time?",
        "num upvote": 6,
        "answer": "You can’t. Babies cry, it’s what they do. You can train a baby sort of like you would train a dog. You can repeat the same message (I’m not going to give into crying) over and over until they stop crying, but what are you accomplishing? I highly doubt that child is going to just say “oh! ok, they’re busy I’ll wait”. No, they will internalize it and come to the conclusion that you, the parent, are not going to help them when they’re in distress. I don’t know if that’s necessarily how you want to start your child/parent relationship. Maybe it is, who am I to judge?Does this mean you need to run and cater to every whimper and whine? Of course not! But saying “baby” implies that the child is not yet old enough to communicate verbally, therefore crying is all they have and how you respond to it shapes how they learn to trust other people. If your child is throwing a tantrum, it’s completely ok to not give in to it, but consider acknowledging it. Developing non-verbal bonds and communication before your baby can talk is crucial to their development.Now, when they’re toddlers, it’s a whole different story. Ignore that shit at will."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-are-some-tips-for-helping-children-adjust-after-a-move",
        "title": "What are some tips for helping children adjust after a move?",
        "num upvote": 5,
        "answer": "Having recently moved my three young children, I feel somewhat qualified to answer this, although I will say with the caveat that my children are 7, 4 and 1, so therefore much more easily adaptable. I think kids over the age of 10 would likely have a harder time dealing with such a transition and in that scenario I have no advice.The thing that helped the most in keeping the kids well adjusted was maintaining the same schedule. Nap times, bed times, meal times, all were the same regardless of the location. Even as we were packing up our old house, we’d have big meals on picnic blankets in the living room, always around the same time.Keeping kids busy is also key. As soon as we moved we had two weeks before the kids started school. We took them each to their new school to explore so that they’d feel comfortable on their first day. We also took them to do things every single day before school started just to keep them busy and not missing our old home.We also tried to maintain a positive attitude, “Don’t you love it here? There’s so much to do!” Seeing us excited definitely made them excited.It’s also a good idea to talk about the move, and remember the old place you lived fondly. We always talk with our kids about their friends from our old home and what we missed about our old town.We have plans to visit our old town to see our friends and revisit the places that we miss. I think maintaining contact is a good idea especially in the beginning when it settles in their minds that we aren’t moving back. They have so many pen pals, we are mailing letters regularly!Having an old home and a new home can be exciting. Of course we miss our old life but our new life is really good too. Showing your kids that you can have it all in a new place and keeping a positive attitude is really the best thing you can do for everyone in your family."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Do-you-think-children-should-be-aware-of-the-news-at-a-young-age-Or-should-they-be-oblivious-to-all-the-bad-things-that-happen-in-our-world",
        "title": "Do you think children should be aware of the news at a young age? Or should they be oblivious to all the bad things that happen in our world?",
        "num upvote": 5,
        "answer": "I strongly believe that sheltering your children will do more harm than good. Let’s take the Duggars for example, imagine if they had had some decent sex education? Perhaps there would have been a few less female victims in that family.The key is age appropriateness. Of course you don’t have to frighten your child or tell them everything in detail, but it’s important to be as honest as possible in all situations.Young Children (0–5 years old): When children are young, they will likely have a hard time grasping big-world ideas. Explaining things as simply, but as honestly as possible is key. You may have to repeat yourself several times for them to fully grasp it, so do so. And always say the same things, keep your message consistent.Example: Aunt Margaret died. That means that she was very sick and couldn’t get better so her body stopped working. Don’t worry, being sick doesn’t make everyone die, so when you, or mommy, or daddy are sick, we will get better, but aunt Margaret did not. She isn’t going to wake up or come back, but we can remember her and talk about her if you want to.Older kids (5–10) are starting to notice the world around them and do better with real world examples. It’s easier to give context and explain things using emotion, but don’t make things too scary.Example: Sometimes people get very angry at the way the world works. Sometimes, very rarely, those people’s brains stop working well and they want to do bad things. Those people have a sickness in their brain and sometimes, when they don’t get help, they will hurt someone. Luckily we have a lot of police, doctors, friends and things that that likely won’t happen to anyone we know, but it does happen in the world. Those people are usually caught. People in our country are mostly safe, so you don’t have to worry as long as you are around grown ups that you trust, but in other parts of the world, it’s not so safe. It’s important to know that other people live differently and to know that there are unsafe things in the world.Teens and Young Adults: Teenagers and older will likely hear or read things on their own or hear them from their friends. Checking in with them to see if they’d like to discuss or have any questions is crucial. Even young adults have a hard time processing difficult things on their own, so being there as a guide is an important step in late parenting.Example: You may have heard about that thing that happened on the news. What have people been saying about it? How do you feel about it? Do you have any questions? What do you think will happen now? How do you think the people involved are feeling? What can we do to help?… Obviously asking these in rapid succession isn’t going to be productive, but choosing one or two will (hopefully) get your child talking. If not, respect that, and allow them to open up in their own time. Maybe provide some sound words so they feel safe about the situation (see advice for older kids).Avoiding talking about difficult issues tells your child that talking about things that make us uncomfortable is wrong or shameful. Closing down lines of communication is harmful. Allowing your child to come to you about anything ensures that they will get the correct information - and that you will control what and how they hear things (for the most part).An important key in telling your children things that might be difficult or scary - is to allow them to react in their own way. Forcing them to talk or asking them too many questions could cause them to shut down and in the long run will make it more difficult to re-open those lines of communication.So to summarize: Be clear, be concise, be consistent, be age appropriate. Please don’t let your kids discover scary things in the world on their own."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-was-the-most-embarrassing-moment-in-front-of-your-parents",
        "title": "What was the most embarrassing moment in front of your parents?",
        "num upvote": 75,
        "answer": "It didn’t happen in front of MY parent, but a while ago, my mother in law (worse!) took my four year old bowling. Afterward he got a toy from a gumball type machine that was locked in a clear bubble. On the drive home he asked her “Grandma, can you open my goddamn toy?!” I was definitely notified of this question and was received with some disappointment - it took a while before I was on her good side again."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Whats-the-hardest-part-about-being-a-parent",
        "title": "What's the hardest part about being a parent?",
        "num upvote": 9,
        "answer": "In the long run, I will have to agree with Michelle and say that the hardest part of parenting will be to let my children fail.But right now my kids are young, and so, my answer is a bit more selfish.On the surface, I’d say the hardest part about parenting (at least young kids) is the bodily excrements you are forced to deal with. Namely, vomit. Kids don’t know to run to the bathroom to vomit, so when they do it, they will do it on anything, and if they’ve been sick more than once, chances are, they are going to do it on you. They will also pee anywhere and will poop in the bathtub many, many, times, (to the point now that I scoop it out and continue on with the bath)… all very disgusting. But the vomit takes the cake. The best/worst part, is that the ONLY person that will make them feel better while simultaneously trying to clear the infectious disaster…. is you. That’s right, within a few years, you will become an expert in cleaning the most disgusting messes out of the hardest to reach crevasses and off the hardest to clean surfaces.The other hard part about parenting is not sleeping. In almost eight years, I have yet to have a morning where I wake up on my own. Also, I have yet to have a night where I’ve gone to bed at a decent hour, because I am trying desperately to have a little more time in the solitude and tranquility that is a quiet house. But it’s all fleeting. After so many years of parenting, the word exhausted is just a joke in this case.The other hardest part (of having young children), but is also the best part, is that your life is not about you anymore. Not even a little. You might have a job, a mortgage, friends… but it all revolves around your kids. What’s best for them, the best way to provide for them, the best life for them. The meaning of your life completely changes when you have a child. Any parent knows that the moment their child is born their world is flipped upside down. I mean, you are responsible for keeping a tiny, defenseless ball of joy ALIVE. Forever. Making sure they grow into a good person is another feat you’ll have to overcome. Yeah, in 18 years they might move out (HAHA! Yeah right), but even then, your days will be filled worrying about them, thinking about them, wishing the best for them, talking to them, and probably giving them money. They will suck you dry in every way possible, but I couldn’t think of anything in the world that is more worth it."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-common-mistakes-do-parents-make",
        "title": "What common mistakes do parents make?",
        "num upvote": 8,
        "answer": "By far the most dangerous thing you can do as a parent is to expect your child to be a certain way. This manifests itself in so many ways. Here are a few:Gender: When we expect boys to do boy things and girls to do girl things, we could be setting them up for failure. Not only are you stifling your child’s interests but you are sending the message that what they are interested could be “bad” or “inappropriate”. To parents who would defend their actions by saying, “but I want my boy to be a boy”, I ask you, what is the harm in holding off on those standards? Or abolishing them altogether? If your son wants to play with dolls or your daughter is interested in automechanics, what will happen if you let them explore that? They will perhaps develop a new hobby, but more importantly, they will receive the message that you, as their parent, will support and encourage them no matter what. This will not only allow them to discover who they are, but to do so with open lines of communication with you, which is the most important part.Behavior: This is one I really struggle with as a parent. I definitely have one child who is “the problem child” and the sad part is, the whole family knows it. When things happen, someone will undoubtedly make a comment about this child’s behavior. I know this is harmful, because he knows this is the expectation of him and will sometimes act accordingly. Not assigning blame and going out of your way to give everyone the benefit of the doubt - regardless of past behavior - shows your child that you are always willing to start over and believe in the goodness of them.Academics: By demanding (or assuming at the very least) that your child is going to be smart and do everything well, you are setting them up for failure. Some children succeed in some areas while struggling in others. Some kids are good at everything and learning comes easily, some kids, not so much. Telling your child that it’s ok, that you will help them and support them no matter what their GPA is so important. Knowing that they won’t be disciplined for something they are struggling in will allow them to work hard to get better, and in the end, that’s what’s most important. Test scores only mean so much in life.Age order: If you’re like me, you expect your oldest child to be the most helpful and pickup on non-verbal cues to get what’s going on around them. The baby is never expected to do anything because they’re the baby. The middle child can go either way, but is usually left to their own devices. There are so many times that I have to remind myself that the oldest child, is still a child. She still needs help and needs room to be a kid with freedom to do what she wants. The baby is also more capable than I give him credit for and at some point I will stop peeling his apples and cutting his food into tiny pieces.I think the MOST important thing you can do as a parent is to be a reliable source of support. Conveying to your child that you will love and accept them NO MATTER WHAT is the best way you can parent, and the first step in doing that is to adjust your expectations and allow your child to be who they are…. the rest will sort itself out nicely."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-are-some-tips-for-hosting-a-successful-playdate",
        "title": "What are some tips for hosting a successful playdate?",
        "num upvote": 3,
        "answer": "Before the playdate: Have a lot of activities ready. Don’t clean the house too well, that way you won’t stress out about it getting dirty and ripped apart. Have lots of snacks/food on hand. Put away anything you don’t want out. Try to create a good flow, have a sense of where and when you want people to be moving around (ex: have food ready in the kitchen to start, then move kids outside, etc.)During the playdate: playdates are all about socializing, but keep one eye on the kids, fights break out and rules get broken when adults aren’t paying attention. Be prepared to step in when needed. Since this is about hosting, I’d lay off the kid that isn’t yours and focus on yours. Verbally communicating to your kid how you’d like them to behave will allow visitors to follow suit. Never interfere or discipline a child that isn’t yours in your home (unless their parent is not present). Relax and enjoy the company."
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/What-are-some-tips-for-going-to-the-beach-with-young-children",
        "title": "What are some tips for going to the beach with young children?",
        "num upvote": 9,
        "answer": ""
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-should-I-deal-with-messy-girls",
        "title": "How should I deal with messy girls?",
        "num upvote": 4,
        "answer": "What do you mean by this? I'm not quite sure why a \"messy girl\" would be different to deal with than a \"messy boy\"? Are girls to be held to different standards? I feel strongly that genderizing certain behaviors can be very dangerous and detrimental to the development and toleration of young, impressionable minds. Teaching them that they need to be a certain way because of their born gender can set them up for failure or self hatred and I'm not sure that's what you'd hope for as a parent or guardian. Gender issues aside, if you are talking about \"messes\", I know a thing or two about how to deal with those. As a self described \"neat freak\" I try my best to manage all three of my children's messes without going overboard or stressing myself out. The first tip I have for managing messiness is to make sure their hands, feet and butts are always clean. This involves a lot of handwashing (and sometimes feet washing). My kids know when they come home and have been exposed to germs outside the first thing they need to do is to take off their shoes and wash their hands. If they've been playing outside for a good part of the day I will also change their clothes when they come inside. I also bathe them as needed, typically every other day and I always use soap. Aside from messy bodies, if you're talking about a messy house, depending on the age of your children, it may be unavoidable. The best advice I can offer is to either have a house cleaner come or set aside a few hours per week to do the deep cleaning. If you take the time to vacuum, dust, wipe down counters and toilets, everything else is just surface mess and easy to clean up. I strongly recommend the book The Life-Changing Magic of Tidying Up: The Japanese Art of Decluttering and Organizing. It's pretty basic, but if everything in your house has a place to be put away, anyone who lives in your house can tidy up at any point. If the base of your house is clean (vacuumed, dusted, wiped), all of the \"things\" can easily be put away and your house will always be 20 minutes away from cleaned up. This is really helpful when you have kids because they'll always know where everything goes and they'll be easy to direct at clean up time. I have three kids and they love to pull stuff out throughout the day. I don't worry too much about clutter or toys on the floor all day and don't rush to clean it up, because I know it'll only take a few minutes to do, so I wait until the day is over to put everything away. When the kids are in bed, the house is clean. Aside from bodies and tidying, teaching your children about responsibility is also key. My kids know to wash their hands when they come home. They also know that when they are done eating, it is expected that they put their dishes in the sink. The older two also know that brushing their teeth and making their beds are the two things they have to do before going to school. Keeping it simple and manageable is the best way to get kids to listen and obey. Give them too many tasks and they'll get overwhelmed and rebel. Keeping it simple and sticking to the basics is the best way to go. They know to clean up what they're playing with before pulling out more toys. They know not to leave a room unless whatever they were using is put away. All of these things take time to teach and to learn, but once they get them down life becomes much simpler. That doesn't mean they don't need constant reminding, but it does make it less of a surprise when I do have to remind them. "
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-do-moms-feel-about-the-trailer-and-premise-for-Bad-Moms",
        "title": "How do moms feel about the trailer and premise for \"Bad Moms\"?",
        "num upvote": 11,
        "answer": "I have a really hard time relating to \"bad moms\" in this movie when they're being played by perfectly coiffed size 0 women like Mila Kunis and Kristin Bell. Rebelling against gluten free, non sugar \"perfect\" moms is not enough to make this film relatable. The fact that she's wearing a front clasp bra does not make her not sexy or a bad woman/mom. If Hollywood wants to make a movie about real moms who feel like shitty moms, they need to do a much better job casting women who represent what moms really look like. I'm not saying there aren't moms out there who look like Mila Kunis, but if you're going to make a movie about women who feel like inadequate parents, please make the women look inadequate. "
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Were-fans-disappointed-by-the-season-6-finale-of-The-Walking-Dead",
        "title": "Were fans disappointed by the season 6 finale of The Walking Dead?",
        "num upvote": 13,
        "answer": "I was not at all disappointed. We've known Negan was coming for a long time, it was so great and worth the wait to see him played by the charming, yet terrifying Jeffrey Dean Morgan (who has also been pretty amazing on The Good Wife this season). The final scene went down pretty accurately to the comics. Here's what I thought was so great about it:The whole episode was tension building. Every turn they made in that RV forced them face to face with Negan's crew, and every time they backed away (despite their promise to the Hilltop community take them out). But pregnant Maggie was seriously sick so I understand their need to not stop and have the battle right then and there. Although, every time they drove down those scary one way roads they'd come across the group who blocked their way and every time the group was bigger. It was frightening to see how many people Negan really has. Arrogant Rick & Co. thought they had taken him out completely when they ambushed the compound in the dead of night and took out about eight soldiers in their sleep. Poor, misguided Rick had no idea what was coming to him after that victory and the viewers had no idea either which made it all that much more thrilling!Seeing Rick on his knees. Oh man, that was a long time coming.  He's been running the show since day 1. Aside from that one part where he went nuts after his wife died and was talking to nobody on a dead phone. Rick has always been cocky and confident and able to take on every opponent. Not this time. I think we all underestimated the power of Negan. What is going on out there beyond the walls? It seems as though the core crew has always managed to find safe haven, yet there's an entire army of people beyond those walls that we know nothing about! I'm fascinated to see the show zoom out and gain a big-picture perspective to what other survivors are doing. Glen's fate has been long teased. We thought he was maybe dead at the mid-season break, but true fans know that his end date will probably have something to do with Negan and a very bloody bat. So we finally saw one of Rick's crew get taken out at the end, after a very charming and witty monologue executed by Negan (crew member and speech). But who is it? I want to venture that it isn't Glen - because I think everyone would be expecting that. Also - Abraham was supposed to die Denise-style, but they took her out instead, so I don't think the show runners are necessarily sticking to the comic book script. There are also some characters in that lineup that we don't care much about (*cough* Aaron *cough* Eugene), and their exits wouldn't disrupt the show in the least. I'm really hoping that they don't take out a weak, insignificant character and then have Carol and Morgan pull up from behind with their horse mounted knights to save the day. That would be a terrible roundup of this mess. I'm really hoping for something bloodier than that. I have to disagree with Susan below - the show does need cliffhangers. The whole show is based on suspense, so ending the season on a \"wrapped up\" note would leave viewers ready to walk away. Also - if you look at the series' ratings over six seasons, the viewership has steadily inclined from little more than 5 million viewers to over 15 million*. I think this is in no small part due to the cliffhangers they leave us with each season.*source: The Walking Dead (TV series) "
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/At-what-age-should-parents-start-teaching-their-kids-to-conduct-basic-financial-transactions",
        "title": "At what age should parents start teaching their kids to conduct basic financial transactions?",
        "num upvote": 27,
        "answer": "As soon as they're able to grasp basic math concepts. Addition and subtraction usually start to become clear around Kindergarten, maybe a bit younger. My parenting philosophy has always been to give my kids as much accurate information as they can handle. So pretty early on my kids learned that mommy and daddy work and get paid money to do so. We use that money to buy things we need like clothes, food, shelter, etc. When my kids ask for things in the store or wonder why we can't live in a bigger house, it's easy to explain why. We also talk to our kids about what we do for our jobs and how and why we get paid to do them. For example: my husband who is a college professor will say that he went to school for a long time so that he could learn enough to teach adults. He now works at a university where through tuition, grants and other funding, the school pays teachers to teach students and that's what daddy does. The school gets money - then gives the money to employees and the employees use that money to live. Everything costs money. Even abstract things like electricity. This is a little harder to explain to kids. The best way to teach kids about money is to open the dialogue when you are spending it. My kids come with me to run errands all the time. Kids don't want lectures, they want to see how things apply in real life. They know that when we get money from our jobs, it goes in a bank and we use a card to pay for things and that using it takes money out of our bank account. I don't like to carry cash and I explain because if I lost my wallet, all of my money would be gone, however, if I lose my wallet with just my bank card, I can cancel the card and my money would be safe in the bank. When my kids get to be four/five years old they also start to get money and gift cards as gifts for birthdays and holidays. I encourage them to use their own \"money\" to buy things they want while we are out. Of course as they get older there will also be discussions about savings and responsibility, but under the age of ten, money relating to transactions seems most appropriate. The kids enjoy adding up what they have and figuring out what they can buy. It also helps when I have to say \"no\" to buying something to then tell them when they've saved up enough money that they can buy it themselves. I also think it's important to not put too much emphasis on money, it is a a part of our lives, but not the sole focus. I want them to know how it works but not to worry about having it or needing to have more of it. As with anything relating to parenting, balance and perspective is crucial. "
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/Do-you-know-any-parents-who-put-a-feminine-name-on-their-sons",
        "title": "Do you know any parents who put a feminine name on their sons?",
        "num upvote": 4,
        "answer": "This is something I struggle with communicating properly, but something I feel strongly about. Gender is not a binary, it's a spectrum. So what is \"feminine\" and what is \"masculine\"? I think if you need genitalia to use it, then that's one thing, but everything else is made up by our own thoughts and opinions about what \"feminine\" and \"masculine\" should be in our society. So are there names that imply one or the other, yes. But to what effect? Does it matter if your name doesn't traditionally match your gender?  And if so, why? I think that's a more important question. Why does a name matter, would a rose by any other name not smell as sweet? So if we, as compassionate people, decide that people can name their children whatever they choose without judgement, I think everyone would benefit. "
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/As-parents-what-are-the-top-5-products-and-services-you-spend-time-searching-for-your-children",
        "title": "As parents, what are the top 5 products and services you spend time searching for your children?",
        "num upvote": 2,
        "answer": "clothes and shoes - this is by far the thing I search for the most, all three of my kids outgrow their clothes at least once a year, add in changing seasons, multiple genders, I'm always needing to buy them things. And once they have enough clothes, then it's things like: outerwear, socks, bathings suits... then they need shoes for all occassions: school, weekend, sandal, dressy. Plus everything looks so much cuter on little bodies so I'm willing to put them in different, fun, up to date styles. activities  - when the kids have a day off from school, I have more work to do. I'm always looking for new things to take them to do outside of the house. And even if it's a place we've been before, I'm always checking websites for hours, rates, etc. Some of my favorite activities include: local, small amusement parks (Children's Fairyland of Oakland), pottery painting, beaches, book stores, indoor play places, etc. medical advice - kids are always getting weird rashes, side effects, coughing spells, etc. Before I email my doctor in a panic I always check online to see if that weird thing my kid has or is doing is something other kids do too. I usually find a lot of good info that way, it actually makes me feel better to look up symptoms rather than make me more paranoid because there's always a good chance other parents out there have dealt with the same thing. party planning - all of my kids' birthdays are close together, so we have a birthday season in our house. Our house is also really small so I'm always looking for new, creative places to host parties. All of their birthdays are in Spring so outdoor parties are always a risk, but I like to look for deals at local play places, bounce houses, parks, etc. Plus it's easy to book and order things online instead of dragging your kids to locations that they won't want to leave. schools/summer camps - when my oldest turned two we started the long process of looking for the perfect preschool. After that we researched elementary schools: public ones and zones, private ones and costs and focuses. Every few years we're researching a new phase of schooling for one of our kids. Then after kindergarten it becomes all about the summer camps, and there are thousands of those. "
    },
    {
        "author_url": "https://www.quora.com/profile/Adrienne-Gomer",
        "title_url": "https://www.quora.com/How-do-I-become-a-dependable-organized-person",
        "title": "How do I become a dependable, organized person?",
        "num upvote": 168,
        "answer": "If there are two words someone would used to describe me, they would definitely be, dependable and organized. Here are ten tips I try to follow:"
    }
]