[
    {
        "author_link": "https://www.quora.com/profile/Adrienne-Gomer",
        "question_title": "What do you tell your children about death if you are an atheist?",
        "views": 488,
        "upvotes": 2,
        "question_link": "https://www.quora.com/What-do-you-tell-your-children-about-death-if-you-are-an-atheist",
        "answer": "What a strange question. Because only religion can explain death? You die whether you believe in God or not. I’m guessing your question is, how can you help your children deal with the sorrow of death if you don’t believe in God? Because religion (in my opinion) is largely about finding comfort in the unexplainable by putting faith in something that’s not based in fact. And that’s fine. I understand that heaven is a construct that people use to help cope with loss. And you can’t argue with me on that point, because I’m positive that the existence of heaven has not been proven in any way. It may feel comforting to tell yourself that there’s a heaven, and maybe to tell your kids that too if that’s what works for you.As an atheist and a mother of three, here’s what I tell my children about death. I try to be as honest as possible (in all situations) with them. I say, “When people die, they are gone. It’s like they go to sleep but they don’t wake up, ever. I know it can be upsetting to think that you will never see that person again, but people live on through the memories we have of them and how they’ve impacted the people around them. We can remember people that have died and try to embody their good qualities and honor their life in so many different ways. It is very sad when someone dies, but it is part of life and the reason we are all connected in such a unique way is because we all have an impact on each other for good or for bad. When people die, their stories can live on, but their bodies will whither and become part of the the earth in one form or another. Some people believe in this idea called heaven and that when you die your spirit goes there and maybe you can be reunited one day. I believe that people created the idea of heaven to make themselves less sad when they lose someone, but it’s ok to believe that if you want to.”Who knows what the right thing to say to kids is. When I told my oldest what death was at the age of three, she was pretty traumatized by it and didn’t want to talk about it for a very long time. My second child was like, ok, and moved on with his day. Every child reacts differently and everyone has a different belief system - and our children will probably adopt ours if we raise them that way. So if you have faith in heaven, tell your children that. I’m sure they will be happier to hear that they will be reunited with people that die one day (and you likely won’t ever have to deal with the consequences if that turns out to not be true). Or you can be honest, like I was, and your children will have to find another way to cope.Funny story, after I told my oldest that when you die, you just die, she asked my mother in law about her mom (who had died several years earlier) and my mother in law told my daughter, “oh it’s ok because I’ll see her again one day in heaven”. I had yet to have the heaven part of the conversation with my daughter. Oy.",
        "author": "Adrienne Gomer"
    },
    {
        "author_link": "https://www.quora.com/profile/Adrienne-Gomer",
        "question_title": "How have you successfully lost a large amount of weight?",
        "views": 437,
        "upvotes": 7,
        "question_link": "https://www.quora.com/How-have-you-successfully-lost-a-large-amount-of-weight",
        "answer": "I gave birth.But in all seriousness, being a woman, and bearing children can do huge damage to your goal weight and self image. Being a tired parent is really hard work, add trying to slim your waistline and you’re asking for something nearly impossible.The only way to really lose a large amount of weight… is to put in a large amount of effort.Like most pragmatic weight loss answers on Quora explain, the only way to lose weight is to burn more calories than you eat. It’s as simple as that. So if you’re stagnant or gaining, you either need to cut calories or get active. Ideally both.The first thing you need to come to grips with is being ok being hungry. It’s a HUGE struggle at first, especially when you are working or with children all day, it’s the easiest discomfort to manage - just eat. Logging your food intake can be hugely beneficial. I know it’s hard to keep track of what you’re eating when you’re putting things in your mouth sporadically throughout the day. Keeping a log can be time consuming, but make a plan to do it for a week - or up to ten weeks if you’re up for it. Not only will it give you a good idea of what you are actually putting in your body (which can be shocking to see on paper), but really counting your calories for a consistent period of time will help you get in the habit of cutting them. It took me ten weeks of logging food to see what I was really eating - and trying to stay in a specific calorie count to maintain a deficit was excruciating at times. But after ten weeks it became habit and I stopped logging. Now I get full easily and I know that if I indulge in a big meal (or donuts, my personal fave), I have to eat lightly for the rest of the day. It’s not about depriving yourself, but being sensible and getting in the habit of eating what is healthy for your body. And once you reach your weight loss goals, you can increase your calories slightly because you will no longer need the deficit you needed in order to lose.The second thing you need to get used to is exercise. Weight loss is mostly about what you eat, so if you are REALLY great at restricting calories, you can probably get away with little to no exercise for pure weight loss. Personally I LOVE to eat, and although I do ok eating less, I do find myself indulging in food - that actually tastes good - pretty regularly. As I’ve written in other answers, getting started is the hardest part. Just like eating, start with an attainable goal - exercise three times a week for one month. I tried to do 300 workouts in 365 days - and logged all of them so I could have a visual representation of my progress. Exercising regularly not only allows you a few extra calories, but also helps shed fat faster and gain muscle tone. Not to mention the long term effects on your overall health.",
        "author": "Adrienne Gomer"
    }
]